bases/WIM_FIn/projects/IMDEV-8772 Устранить отмену проведение и повторное проведение Сделки/VTB_ExchangeDU/InformationRegisters/ExchDU_СостояниеОбъектовЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ExchDU_СостояниеОбъектовЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтоБП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПотока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bases/WIM_FIn/projects/IMDEV-8772 Устранить отмену проведение и повторное проведение Сделки/VTB_ExchangeDU/Enums/ExchDU_СостояниеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ExchDU_СостояниеОбработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
					<Comment>Обрабатывается после загрузки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bases/WIM_FIn/projects/IMDEV-8772 Устранить отмену проведение и повторное проведение Сделки/VTB_ExchangeDU/WebServices/NDFL/Ext/Module.bsl
&Вместо("upload_data")
Функция IMDEV_3254_upload_data(Параметры)
	//{[+] IMDEV-3254 N.Filimonova 18.02.2022
	
	Отказ 						= Ложь; 
	ЗапускОперацийПослеОбмена 	= Ложь;  
	ИдентификаторОбмена 		= Неопределено;
	ИдентификаторПотока 		= Неопределено;
	Комментарий 				= ""; 
	СтатусЗагрузки              = "";
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);	
	КонецЕсли;     
	
	ДатыЗапретаИзмененияСлужебный.ПропуститьПроверкуЗапретаИзменения();
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(Параметры);
	СтруктураПараметров = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть(); 
	
	СтруктураПараметров.Свойство("ИдентификаторОбмена", ИдентификаторОбмена); 
	
	ВременныйИдентификаторПотока = Новый УникальныйИдентификатор;
	УстановитьСостояниеПотокаОбмена(ИдентификаторОбмена, ИдентификаторПотока, СтатусЗагрузки, Перечисления.ExchDU_СостояниеОбработки.Новый, ВременныйИдентификаторПотока);
	
	ОбработкаXML = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	ЗаполнитьЗначенияСвойств(ОбработкаXML, СтруктураПараметров, "ИмяФайлаОбмена, ЗагружатьДанныеВРежимеОбмена,
	|ЗаписыватьВИнформационнуюБазуТолькоИзмененныеОбъекты, ОптимизированнаяЗаписьОбъектов, ЗаписыватьРегистрыНаборамиЗаписей, ИспользоватьТранзакции, КоличествоОбъектовНаТранзакцию");
	
	// IMAPPS-29796++
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") 
		И СтруктураПараметров.Свойство("ИмяФайлаПротоколаОбмена") 
		И ЗначениеЗаполнено(СтруктураПараметров.ИмяФайлаПротоколаОбмена) Тогда
		
		ОбработкаXML.ИмяФайлаПротоколаОбмена = СтруктураПараметров.ИмяФайлаПротоколаОбмена;
		ОбработкаXML.ВыводВПротоколИнформационныхСообщений = Ложь;
		ОбработкаXML.ВыводВПротоколСообщенийОбОшибках = Истина;
	КонецЕсли;
	// IMAPPS-29796--
	
	// Обходит вызов исключения при параллельной записи объектов
	// но так же не производит (пропускает) запись новых/измененных объектов в базу при ошибке записи
	ОбработкаXML.ФлагРежимОтладки = Истина;
	
	ОбработкаXML.РежимОбмена = "Загрузка";
	ОбработкаXML.ВыполнитьЗагрузку();
	
	// IMAPPS-29796++
	Если ОбработкаXML.ФлагОшибки Тогда
		ИмяСобытия = "ВыполнитьОбменДУ_Финансы";
		
		ЧтениеТекстаПротокола = Новый ЧтениеТекста(ОбработкаXML.ИмяФайлаПротоколаОбмена);
		ТекстПротоколаОбмена = ЧтениеТекстаПротокола.Прочитать(5000);
		ЧтениеТекстаПротокола.Закрыть();
		ОписаниеОшибкиЗагрузки = "Ошибка при загрузке ФИН" + Символы.ПС + ТекстПротоколаОбмена;
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, ,, ОписаниеОшибкиЗагрузки);
		
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ФлагОшибки", Истина);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураВозврата);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Возврат СтрокаJSON;      
		
	КонецЕсли;
	// IMAPPS-29796--

	ПараметрыОбработкиXML = ОбработкаXML.Параметры.ХранилищеПараметры.Получить();
	ПараметрыОбработкиXML.Свойство("ИдентификаторПотока", ИдентификаторПотока); 

	СтатусЗагрузки = Не (ОбработкаXML.ФлагОшибки И ОбработкаXML.мСчетчикЗагруженныхОбъектов = 0);
	УстановитьСостояниеПотокаОбмена(ИдентификаторОбмена, ИдентификаторПотока, СтатусЗагрузки, Перечисления.ExchDU_СостояниеОбработки.Загружен, ВременныйИдентификаторПотока, ПараметрыОбработкиXML);
	
	ОчищатьСпискиДляОбработки = Истина;
	Если Не СтруктураПараметров.Свойство("ОчищатьСпискиДляОбработки", ОчищатьСпискиДляОбработки) Тогда
		ОчищатьСпискиДляОбработки = Истина;
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("ЗапускОперацийПослеОбмена", ЗапускОперацийПослеОбмена) = Ложь Тогда
		ЗапускОперацийПослеОбмена = Ложь;
	КонецЕсли;  
		
		
	ExchDU_ОбработкаОбъектовПослеЗагрузки.ЗаписьЛоговОбмена(ПараметрыОбработкиXML, ИдентификаторОбмена, ИдентификаторПотока);

	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("ФлагОшибки", ОбработкаXML.ФлагОшибки И ОбработкаXML.мСчетчикЗагруженныхОбъектов = 0);
	ИмяФайлаПараметры = ПолучитьИмяВременногоФайла("xml");
	ЗначениеВФайл(ИмяФайлаПараметры, ПараметрыОбработкиXML);
	СтруктураВозврата.Вставить("ИмяФайлаПараметры", ИмяФайлаПараметры);  
	
	Сообщить(ОписаниеОшибки());
	
	РассылкаСообщений(ИдентификаторОбмена, СтруктураПараметров);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураВозврата);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;      
	
	//} IMDEV-3254 N.Filimonova
КонецФункции   

Функция КоличествоПотоковПолученных(ИдентификаторОбмена)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ExchDU_ПотокиОбмена.ИдентификаторОбмена КАК ИдентификаторОбмена,
		|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ExchDU_ПотокиОбмена.ИдентификаторПотока), 0) КАК КоличествоПотоков
		|ИЗ
		|	РегистрСведений.ExchDU_ПотокиОбмена КАК ExchDU_ПотокиОбмена
		|ГДЕ
		|	ExchDU_ПотокиОбмена.ИдентификаторОбмена = &ИдентификаторОбмена
		|
		|СГРУППИРОВАТЬ ПО
		|	ExchDU_ПотокиОбмена.ИдентификаторОбмена";
	
	Запрос.УстановитьПараметр("ИдентификаторОбмена", ИдентификаторОбмена);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КоличествоПотоков;	
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Процедура РассылкаСообщений(ИдентификаторОбмена, СтруктураПараметров)      
	
	Рассылка = Ложь;       
	ВсегоЗагружено 		= 0;      
	ВсегоНеЗагрузилось 	= 0;    
	ВсегоЗагружалось 	= 0; 
	Описание = "";
	СообщенияЗагрузки = "";
	БылиОшибки = Ложь;
	Отказ = Ложь;
	
	СписокРассылки = СтруктураПараметров.СписокРассылки;
	
	СтруктураРассылки = ПодготовкаСтруктурыРассылки(ИдентификаторОбмена);	
	Рассылка = СтруктураРассылки.Рассылка;	
	СтатусЗагрузки = СтруктураРассылки.СтатусЗагрузки;	
	ПараметрыПотоков = СтруктураРассылки.ПараметрыПотоков;

	Если Рассылка = Истина  Тогда 
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ОтображатьГруппировки 	= Ложь;
		ТабДокумент.ОтображатьСетку 		= Ложь;
		ТабДокумент.ОтображатьЗаголовки 	= Ложь;
		
		Лог = СформируемЛогЗагрузки(ПараметрыПотоков, ТабДокумент, ВсегоЗагружено, ВсегоНеЗагрузилось, БылиОшибки, СообщенияЗагрузки);
		
		
		Наименование = "Обмен ДУ-Финансы 3.0 (многопоточно, в фоновом режиме)"; 
		
		Если БылиОшибки = Истина Или ВсегоНеЗагрузилось <> 0 Тогда 		
			Описание = "При выполнении были ошибки:" + Символы.ПС + СообщенияЗагрузки;
		Иначе
			Описание = "Загрузка успешна";
		КонецЕсли;        
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, Вложения, Важность");
		ПараметрыПисьма.Тема	 = ?(Отказ, "{FAIL} ", ?(БылиОшибки ИЛИ ВсегоНеЗагрузилось <> 0, "{WARN} ", "{OK} ")) + "Аванкор ДУ: " + Наименование + ПропискаРассылки("r0");
		ПараметрыПисьма.Важность = ?(Отказ ИЛИ БылиОшибки ИЛИ ВсегоНеЗагрузилось <> 0, ВажностьИнтернетПочтовогоСообщения.Высокая, ВажностьИнтернетПочтовогоСообщения.Обычная);
		ПараметрыПисьма.Тело	 =  Описание;
		
		Кому = Новый Массив;
		Для Каждого ТекЯщик из СписокРассылки Цикл
			Кому.Добавить(Новый Структура("Адрес,Представление", ТекЯщик, ТекЯщик)); 
		КонецЦикла;
		
		ПараметрыПисьма.Кому = Кому;
		
		ПутьКФайлу = ПолучитьИмяВременногоФайла("XLS");
		Лог.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLS);
		
		ПутьКZip = ПолучитьИмяВременногоФайла("zip");
		Упаковка = Новый ЗаписьZipФайла(ПутьКZip);
		Упаковка.Добавить(ПутьКФайлу);
		Упаковка.Записать();
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКZip);
		АдресВложения = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		Вложения = Новый Соответствие;
		Вложения.Вставить("Лог.zip",АдресВложения);
		
		ПараметрыПисьма.Вложения = Вложения;
		
		Попытка
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыПисьма);
			текстРассылки = "Рассылка завершена";
		Исключение
			текстРассылки = "Рассылка не удалась: " + ОписаниеОшибки(); 
			Сообщения = ПолучитьСообщенияПользователю(Истина);
			Для Каждого Элемент из Сообщения Цикл
				  текстРассылки = текстРассылки + Символы.ПС + Элемент.Текст;
			КонецЦикла;
		КонецПопытки;
		
	КонецЕсли;	 
		
КонецПроцедуры  

Функция ПодготовкаСтруктурыРассылки(ИдентификаторОбмена)  
	
	Рассылка = Ложь; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ExchDU_ПотокиОбмена.СостояниеОбработки КАК СостояниеОбработки
	|ИЗ
	|	РегистрСведений.ExchDU_ПотокиОбмена КАК ExchDU_ПотокиОбмена
	|ГДЕ
	|	ExchDU_ПотокиОбмена.ИдентификаторОбмена = &ИдентификаторОбмена
	|
	|СГРУППИРОВАТЬ ПО
	|	ExchDU_ПотокиОбмена.СостояниеОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ExchDU_ПотокиОбмена.ПараметрыОбработки КАК ПараметрыОбработки,
	|	ExchDU_ПотокиОбмена.СтатусЗагрузки КАК ЗагруженУспешно,
	|	ВложенныйЗапрос.Комментарий КАК СообщенияПотока
	|ИЗ
	|	РегистрСведений.ExchDU_ПотокиОбмена КАК ExchDU_ПотокиОбмена
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ExchDU_СостояниеОбъектовЗагрузки.Комментарий КАК Комментарий,
	|			ExchDU_СостояниеОбъектовЗагрузки.ИдентификаторПотока КАК ИдентификаторПотока
	|		ИЗ
	|			РегистрСведений.ExchDU_СостояниеОбъектовЗагрузки КАК ExchDU_СостояниеОбъектовЗагрузки
	|		ГДЕ
	|			ExchDU_СостояниеОбъектовЗагрузки.ИдентификаторОбмена = &ИдентификаторОбмена
	|			И ExchDU_СостояниеОбъектовЗагрузки.Тип = ""Сообщения пользователю"") КАК ВложенныйЗапрос
	|		ПО ExchDU_ПотокиОбмена.ИдентификаторПотока = ВложенныйЗапрос.ИдентификаторПотока
	|ГДЕ
	|	ExchDU_ПотокиОбмена.ИдентификаторОбмена = &ИдентификаторОбмена";
	
	Запрос.УстановитьПараметр("ИдентификаторОбмена", ИдентификаторОбмена);   
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	СтатусЗагрузки =   РезультатЗапроса[0].Выгрузить();
    ПараметрыПотоков = РезультатЗапроса[1].Выгрузить();
	
	Если СтатусЗагрузки.Количество() = 1 И СтатусЗагрузки[0].СостояниеОбработки = Перечисления.ExchDU_СостояниеОбработки.Загружен Тогда
		Рассылка = Истина; 
	КонецЕсли;  
	
    СтруктураРассылки = Новый Структура; 
	СтруктураРассылки.Вставить("Рассылка", Рассылка);	
	СтруктураРассылки.Вставить("СтатусЗагрузки", СтатусЗагрузки);	
	СтруктураРассылки.Вставить("ПараметрыПотоков", ПараметрыПотоков);
	
	Возврат СтруктураРассылки 

КонецФункции

Функция СформируемЛогЗагрузки(ПараметрыПотоков, ТабДокумент, ВсегоЗагружено, ВсегоНеЗагрузилось, БылиОшибки, СообщенияЗагрузки)
	
	Макет = ПолучитьОбщийМакет("ЛогОбмена_ДУ_ФИН");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ДатаФормирования = ТекущаяДата();
	ТабДокумент.Вывести(Шапка);      
	
	СтруктураОбщиеТаблицыПотоков = ОбъединениеТаблицПотоков(ПараметрыПотоков, БылиОшибки, СообщенияЗагрузки);
	
	ТаблицаЗагруженныхОбъектов 			= СтруктураОбщиеТаблицыПотоков.ТаблицаЗагруженныхОбъектов; 
	ТаблицаНеЗагруженныхОбъектов 		= СтруктураОбщиеТаблицыПотоков.ТаблицаНеЗагруженныхОбъектов; 
	СписокСправочниковКЗагрузке 		= СтруктураОбщиеТаблицыПотоков.СписокСправочниковКЗагрузке; 
	СтрокиОтбораРучныхКорректировок 	= ТаблицаЗагруженныхОбъектов.НайтиСтроки(Новый Структура("РучнаяКорректировка",Истина));
	
	Если СписокСправочниковКЗагрузке.Количество() > 0 Тогда 
		ОбластьШапкаСправочники = Макет.ПолучитьОбласть("ШапкаСправочники");
		ТабДокумент.Вывести(ОбластьШапкаСправочники);
	КонецЕсли;
	
	
	ВсегоЗагружено 		= ТаблицаЗагруженныхОбъектов.Количество();
	ВсегоНеЗагрузилось 	= ТаблицаНеЗагруженныхОбъектов.Количество();
	
	МассивВидовСправочников = Новый Массив;
	
	МассивВидовСправочников.Добавить("ДоговорДУ");
	МассивВидовСправочников.Добавить("ДоговорыКонтрагентов");
	МассивВидовСправочников.Добавить("Контрагенты");
	МассивВидовСправочников.Добавить("БанковскиеСчета");
	МассивВидовСправочников.Добавить("СчетаДепо");
	МассивВидовСправочников.Добавить("ТорговыеКоды");
	МассивВидовСправочников.Добавить("АналитическиеСчета");
	МассивВидовСправочников.Добавить("Активы");
	
	МассивВидовДокументов = Новый Массив;
	
	МассивВидовДокументов.Добавить("ПоступлениеНаРасчетныйСчет");
	МассивВидовДокументов.Добавить("СписаниеСРасчетногоСчета");
	МассивВидовДокументов.Добавить("Сделка");
	МассивВидовДокументов.Добавить("СделкаНаСрочномРынке");   
	МассивВидовДокументов.Добавить("СделкаНаВалютномРынке");
	МассивВидовДокументов.Добавить("ОфертаПоОблигациям");
	МассивВидовДокументов.Добавить("СделкаМНО");
	МассивВидовДокументов.Добавить("ПараметрыРасчетаБанковскихПроцентов");
	
	МассивВидовДокументов.Добавить("ОперацияПоСчетуБрокера");
	МассивВидовДокументов.Добавить("НачислениеВознаграждения");
	
	МассивВидовДокументов.Добавить("ВводВыводЦенныхБумагИзДУ");
	МассивВидовДокументов.Добавить("КонвертацияАктивов");
	МассивВидовДокументов.Добавить("КорпоративноеДействие");
	
	МассивВидовБП = Новый Массив;
	МассивВидовБП.Добавить("ВнебиржеваяСделка");
	МассивВидовБП.Добавить("СделкиTn");
	МассивВидовБП.Добавить("СделкиРЕПО");
	
	Для Каждого ВидСправочника из МассивВидовСправочников Цикл
		
		ОбластьСправочникВид = Макет.ПолучитьОбласть("СправочникВид");
		
		КолЗагруженных = 0;
		КолНеЗагруженных = 0;
		
		СтрокиОтбораЗагруженныхОбъектов = ТаблицаЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидСправочника));
		КолЗагруженных = СтрокиОтбораЗагруженныхОбъектов.Количество();
		
		СтрокиОтбораНеЗагруженныхОбъектов = ТаблицаНеЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидСправочника));
		КолНеЗагруженных = СтрокиОтбораНеЗагруженныхОбъектов.Количество();
		
		
		ОбластьСправочникВид.Параметры.Справочник = ВидСправочника;
		ОбластьСправочникВид.Параметры.КоличествоУспешно = КолЗагруженных;
		ОбластьСправочникВид.Параметры.КоличествоСОшибкой = КолНеЗагруженных;
		
		ТабДокумент.Вывести(ОбластьСправочникВид);
		
		Для Каждого СтрокаС_Ошибкой из СтрокиОтбораНеЗагруженныхОбъектов Цикл
			ОбластьСправочникОшибка = Макет.ПолучитьОбласть("СправочникОшибка");
			ОбластьСправочникОшибка.Параметры.Справочник = СтрокаС_Ошибкой.Представление;
			ТабДокумент.Вывести(ОбластьСправочникОшибка);
		КонецЦикла;
		
	КонецЦикла;
	
	
	ОбластьШапкаДокументы = Макет.ПолучитьОбласть("ШапкаДокументы");
	ТабДокумент.Вывести(ОбластьШапкаДокументы);  
	
	
	Если СтрокиОтбораРучныхКорректировок.Количество() > 0 Тогда
		
		ОбластьДокументВид = Макет.ПолучитьОбласть("ДокументРучнаяКорректировка");      
		ТабДокумент.Вывести(ОбластьДокументВид);   
		
		Для Каждого СтрокаОтбораРучныхКорректировок Из СтрокиОтбораРучныхКорректировок Цикл	
			ОбластьДокументСтрока = Макет.ПолучитьОбласть("ДокументСтрокаРучнаяКорректировка");
			ОбластьДокументСтрока.Параметры.Документ 	= СтрокаОтбораРучныхКорректировок.Представление;
			ОбластьДокументСтрока.Параметры.Статус 		= СтрокаОтбораРучныхКорректировок.Статус;
			ТабДокумент.Вывести(ОбластьДокументСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ВидДокумента из МассивВидовДокументов Цикл
		
		ОбластьДокументВид = Макет.ПолучитьОбласть("ДокументВид");
		
		КолЗагруженных = 0;
		КолНеЗагруженных = 0;
		
		СтрокиОтбораЗагруженныхОбъектов = ТаблицаЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидДокумента));
		КолЗагруженных = СтрокиОтбораЗагруженныхОбъектов.Количество();
		
		СтрокиОтбораНеЗагруженныхОбъектов = ТаблицаНеЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидДокумента));
		КолНеЗагруженных = СтрокиОтбораНеЗагруженныхОбъектов.Количество();
		
		
		ОбластьДокументВид.Параметры.Документ = ВидДокумента;
		ОбластьДокументВид.Параметры.КоличествоУспешно = КолЗагруженных;
		ОбластьДокументВид.Параметры.КоличествоСОшибкой = КолНеЗагруженных;
		
		ТабДокумент.Вывести(ОбластьДокументВид);
		
		Для Каждого СтрокаЗагружено из СтрокиОтбораЗагруженныхОбъектов Цикл
			ОбластьДокументСтрока = Макет.ПолучитьОбласть("ДокументСтрока");
			ОбластьДокументСтрока.Параметры.Документ 	= СтрокаЗагружено.Представление;
			ОбластьДокументСтрока.Параметры.Статус 		= СтрокаЗагружено.Статус;
			ТабДокумент.Вывести(ОбластьДокументСтрока);
		КонецЦикла;
		
		Для Каждого СтрокаС_Ошибкой из СтрокиОтбораНеЗагруженныхОбъектов Цикл
			ОбластьДокументСтрока = Макет.ПолучитьОбласть("ДокументСтрока");
			ОбластьДокументСтрока.Параметры.Документ 	= СтрокаС_Ошибкой.Представление;
			ОбластьДокументСтрока.Параметры.Статус 	= СтрокаС_Ошибкой.Статус;
			ОбластьДокументСтрока.Параметры.ОписаниеОшибки = СтрокаС_Ошибкой.ОписаниеОшибки;
			ТабДокумент.Вывести(ОбластьДокументСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьШапкаБП = Макет.ПолучитьОбласть("ШапкаБизнесПроцессы");
	ТабДокумент.Вывести(ОбластьШапкаБП);
	
	Для Каждого ВидБизнесПроцесса из МассивВидовБП Цикл
		
		ОбластьБизнесПроцессВид = Макет.ПолучитьОбласть("БизнесПроцессВид");
		
		КолЗагруженных = 0;
		КолНеЗагруженных = 0;
		
		СтрокиОтбораЗагруженныхОбъектов = ТаблицаЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидБизнесПроцесса));
		КолЗагруженных = СтрокиОтбораЗагруженныхОбъектов.Количество();
		
		СтрокиОтбораНеЗагруженныхОбъектов = ТаблицаНеЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидБизнесПроцесса));
		КолНеЗагруженных = СтрокиОтбораНеЗагруженныхОбъектов.Количество();
		
		
		ОбластьБизнесПроцессВид.Параметры.БизнесПроцесс = ВидБизнесПроцесса;
		ОбластьБизнесПроцессВид.Параметры.КоличествоУспешно = КолЗагруженных;
		ОбластьБизнесПроцессВид.Параметры.КоличествоСОшибкой = КолНеЗагруженных;
		
		ТабДокумент.Вывести(ОбластьБизнесПроцессВид);
		
		Для Каждого СтрокаЗагружено из СтрокиОтбораЗагруженныхОбъектов Цикл
			ОбластьБизнесПроцессСтрока = Макет.ПолучитьОбласть("БизнесПроцессСтрока");
			ОбластьБизнесПроцессСтрока.Параметры.БизнесПроцесс 	= СтрокаЗагружено.Представление;
			ОбластьБизнесПроцессСтрока.Параметры.Статус 		= СтрокаЗагружено.Статус;
			ОбластьОформления = ТабДокумент.Вывести(ОбластьБизнесПроцессСтрока);
			Если СтрокаЗагружено.Статус = "Изменен" Тогда
				ТабДокумент.Область(ОбластьОформления.Верх, ОбластьОформления.Лево, ОбластьОформления.Низ, ОбластьОформления.Лево).ЦветФона = WebЦвета.Красный;
			КонецЕсли; 
		КонецЦикла;
		
		Для Каждого СтрокаС_Ошибкой из СтрокиОтбораНеЗагруженныхОбъектов Цикл
			ОбластьБизнесПроцессСтрока = Макет.ПолучитьОбласть("БизнесПроцессСтрока");
			ОбластьБизнесПроцессСтрока.Параметры.БизнесПроцесс 	= СтрокаС_Ошибкой.Представление;
			ОбластьБизнесПроцессСтрока.Параметры.Статус 	= СтрокаС_Ошибкой.Статус;
			ОбластьБизнесПроцессСтрока.Параметры.ОписаниеОшибки = СтрокаС_Ошибкой.ОписаниеОшибки;
			ТабДокумент.Вывести(ОбластьБизнесПроцессСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции  

 Функция ОбъединениеТаблицПотоков(ПараметрыПотоков, БылиОшибки, СообщенияЗагрузки)
	
	ТаблицаЗагруженныхОбъектов = Новый ТаблицаЗначений;
	ТаблицаЗагруженныхОбъектов.Колонки.Добавить("ЭтоДокумент");
	ТаблицаЗагруженныхОбъектов.Колонки.Добавить("ЭтоБП");
	ТаблицаЗагруженныхОбъектов.Колонки.Добавить("Тип");
	ТаблицаЗагруженныхОбъектов.Колонки.Добавить("УИД");
	ТаблицаЗагруженныхОбъектов.Колонки.Добавить("Статус");
	ТаблицаЗагруженныхОбъектов.Колонки.Добавить("Представление"); 
	ТаблицаЗагруженныхОбъектов.Колонки.Добавить("РучнаяКорректировка");
	
	
	ТаблицаНеЗагруженныхОбъектов = Новый ТаблицаЗначений;
	ТаблицаНеЗагруженныхОбъектов.Колонки.Добавить("ЭтоДокумент");
	ТаблицаНеЗагруженныхОбъектов.Колонки.Добавить("ЭтоБП");
	ТаблицаНеЗагруженныхОбъектов.Колонки.Добавить("Тип");
	ТаблицаНеЗагруженныхОбъектов.Колонки.Добавить("УИД");
	ТаблицаНеЗагруженныхОбъектов.Колонки.Добавить("Статус");
	ТаблицаНеЗагруженныхОбъектов.Колонки.Добавить("ОписаниеОшибки");
	ТаблицаНеЗагруженныхОбъектов.Колонки.Добавить("Представление");
	
    СписокСправочниковКЗагрузке = Новый Массив;	
	
	Для Каждого ПараметрыХранилище Из ПараметрыПотоков Цикл  
		
		
		Если ПараметрыХранилище.ЗагруженУспешно = Ложь Тогда
			БылиОшибки = Истина;
		КонецЕсли;
		
		СообщенияЗагрузки = СообщенияЗагрузки + Символы.ПС + ПараметрыХранилище.СообщенияПотока;
			
		ПараметрыПотока = ПараметрыХранилище.ПараметрыОбработки.Получить();	 
		
		ПараметрыТаблицаЗагруженныхОбъектов = ПараметрыПотока.ТаблицаЗагруженныхОбъектов;
		ПараметрыТаблицаНеЗагруженныхОбъектов = ПараметрыПотока.ТаблицаНеЗагруженныхОбъектов;  
		
		Для Каждого СтрокаПараметрыТаблицаЗагруженныхОбъектов Из ПараметрыТаблицаЗагруженныхОбъектов Цикл
			НоваяСтрокаЗагруженных = ТаблицаЗагруженныхОбъектов.Добавить();	  
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗагруженных, СтрокаПараметрыТаблицаЗагруженныхОбъектов);
		КонецЦикла;	
		
		Для Каждого СтрокаПараметрыТаблицаНеЗагруженныхОбъектов Из ПараметрыТаблицаНеЗагруженныхОбъектов Цикл
			НоваяСтрокаНеЗагруженных = ТаблицаНеЗагруженныхОбъектов.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяСтрокаНеЗагруженных, СтрокаПараметрыТаблицаНеЗагруженныхОбъектов);
		КонецЦикла;	
		
		Для Каждого СтрокаСправочник Из ПараметрыПотока.СписокСправочниковКЗагрузке Цикл
			СписокСправочниковКЗагрузке.Добавить(СтрокаСправочник);	
		КонецЦикла;	
		
	КонецЦикла;  
	
	СтруктураОбщиеТаблицыПотоков = Новый Структура;
	СтруктураОбщиеТаблицыПотоков.Вставить("ТаблицаЗагруженныхОбъектов", ТаблицаЗагруженныхОбъектов);
	СтруктураОбщиеТаблицыПотоков.Вставить("ТаблицаНеЗагруженныхОбъектов", ТаблицаНеЗагруженныхОбъектов);
	СтруктураОбщиеТаблицыПотоков.Вставить("СписокСправочниковКЗагрузке", СписокСправочниковКЗагрузке); 
	
	Возврат СтруктураОбщиеТаблицыПотоков;
	
КонецФункции	

Функция ЗаполнениеСтруктурыТиповОбъектов();
	
	МассивВидовСправочников = Новый Массив;
	МассивВидовСправочников.Добавить("ДоговорДУ");
	МассивВидовСправочников.Добавить("ДоговорыКонтрагентов");
	МассивВидовСправочников.Добавить("Контрагенты");
	МассивВидовСправочников.Добавить("БанковскиеСчета");
	МассивВидовСправочников.Добавить("СчетаДепо");
	МассивВидовСправочников.Добавить("ТорговыеКоды");
	МассивВидовСправочников.Добавить("АналитическиеСчета");
	МассивВидовСправочников.Добавить("Активы");

	МассивВидовДокументов = Новый Массив;
	МассивВидовДокументов.Добавить("ПоступлениеНаРасчетныйСчет");
	МассивВидовДокументов.Добавить("СписаниеСРасчетногоСчета");
	МассивВидовДокументов.Добавить("Сделка");
	МассивВидовДокументов.Добавить("СделкаНаСрочномРынке");  
	МассивВидовДокументов.Добавить("СделкаНаВалютномРынке");
	МассивВидовДокументов.Добавить("ОфертаПоОблигациям");
	МассивВидовДокументов.Добавить("СделкаМНО");
	МассивВидовДокументов.Добавить("ПараметрыРасчетаБанковскихПроцентов");
	МассивВидовДокументов.Добавить("ОперацияПоСчетуБрокера");
	МассивВидовДокументов.Добавить("НачислениеВознаграждения");
	МассивВидовДокументов.Добавить("ВводВыводЦенныхБумагИзДУ");
	МассивВидовДокументов.Добавить("КонвертацияАктивов");
	МассивВидовДокументов.Добавить("КорпоративноеДействие");

	МассивВидовБП = Новый Массив;
	МассивВидовБП.Добавить("ВнебиржеваяСделка");
	МассивВидовБП.Добавить("СделкиTn");
	МассивВидовБП.Добавить("СделкиРЕПО");  
	
	Возврат Новый Структура("МассивВидовСправочников, МассивВидовДокументов, МассивВидовБП", МассивВидовСправочников, МассивВидовДокументов, МассивВидовБП);

КонецФункции   

Функция СостояниеОбъектов(ИдентификаторОбмена)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ExchDU_СостояниеОбъектовЗагрузки.ДатаОбмена КАК ДатаОбмена,
		|	ExchDU_СостояниеОбъектовЗагрузки.ИдентификаторОбмена КАК ИдентификаторОбмена,
		|	ExchDU_СостояниеОбъектовЗагрузки.ИдентификаторПотока КАК ИдентификаторПотока,
		|	ExchDU_СостояниеОбъектовЗагрузки.УИД КАК УИД,
		|	ExchDU_СостояниеОбъектовЗагрузки.Представление КАК Представление,
		|	ExchDU_СостояниеОбъектовЗагрузки.ЭтоБП КАК ЭтоБП,
		|	ExchDU_СостояниеОбъектовЗагрузки.Тип КАК Тип,
		|	ExchDU_СостояниеОбъектовЗагрузки.Статус КАК Статус,
		|	ExchDU_СостояниеОбъектовЗагрузки.Комментарий КАК Комментарий,
		|	ExchDU_СостояниеОбъектовЗагрузки.ОписаниеОшибки КАК ОписаниеОшибки
		|ИЗ
		|	РегистрСведений.ExchDU_СостояниеОбъектовЗагрузки КАК ExchDU_СостояниеОбъектовЗагрузки
		|ГДЕ
		|	ExchDU_СостояниеОбъектовЗагрузки.ИдентификаторОбмена = &ИдентификаторОбмена
		|	И ExchDU_СостояниеОбъектовЗагрузки.Статус <> ""Ошибка""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ExchDU_СостояниеОбъектовЗагрузки.ДатаОбмена КАК ДатаОбмена,
		|	ExchDU_СостояниеОбъектовЗагрузки.ИдентификаторОбмена КАК ИдентификаторОбмена,
		|	ExchDU_СостояниеОбъектовЗагрузки.ИдентификаторПотока КАК ИдентификаторПотока,
		|	ExchDU_СостояниеОбъектовЗагрузки.УИД КАК УИД,
		|	ExchDU_СостояниеОбъектовЗагрузки.Представление КАК Представление,
		|	ExchDU_СостояниеОбъектовЗагрузки.ЭтоБП КАК ЭтоБП,
		|	ExchDU_СостояниеОбъектовЗагрузки.Тип КАК Тип,
		|	ExchDU_СостояниеОбъектовЗагрузки.Статус КАК Статус,
		|	ExchDU_СостояниеОбъектовЗагрузки.Комментарий КАК Комментарий,
		|	ExchDU_СостояниеОбъектовЗагрузки.ОписаниеОшибки КАК ОписаниеОшибки
		|ИЗ
		|	РегистрСведений.ExchDU_СостояниеОбъектовЗагрузки КАК ExchDU_СостояниеОбъектовЗагрузки
		|ГДЕ
		|	ExchDU_СостояниеОбъектовЗагрузки.ИдентификаторОбмена = &ИдентификаторОбмена
		|	И ExchDU_СостояниеОбъектовЗагрузки.Статус = ""Ошибка""";
	
	Запрос.УстановитьПараметр("ИдентификаторОбмена", ИдентификаторОбмена);
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции 

Функция ФормированиеЛогаЗагрузкиВТабДок(ИдентификаторОбмена) 
	
	Макет = ПолучитьОбщийМакет("ЛогОбмена_ДУ_ФИН");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОтображатьГруппировки 	= Ложь;
	ТабДокумент.ОтображатьСетку 		= Ложь;
	ТабДокумент.ОтображатьЗаголовки 	= Ложь;

	Заголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДокумент.Вывести(Заголовок);
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ДатаФормирования = ТекущаяДата();
	ТабДокумент.Вывести(Шапка);
	
	ОбластьШапкаСправочники = Макет.ПолучитьОбласть("ШапкаСправочники");
	ТабДокумент.Вывести(ОбластьШапкаСправочники);
	
	СтруктураТиповОбъектов = ЗаполнениеСтруктурыТиповОбъектов();
	
	МассивВидовСправочников = СтруктураТиповОбъектов.МассивВидовСправочников;
	МассивВидовДокументов = СтруктураТиповОбъектов.МассивВидовДокументов;
	МассивВидовБП = СтруктураТиповОбъектов.МассивВидовБП;
	
	РезультатЗапроса = СостояниеОбъектов(ИдентификаторОбмена); 
	
	ТаблицаЗагруженныхОбъектов = РезультатЗапроса[0].Выгрузить();
	ТаблицаНеЗагруженныхОбъектов = РезультатЗапроса[1].Выгрузить();
	
	Для Каждого ВидСправочника из МассивВидовСправочников Цикл
		
		ОбластьСправочникВид = Макет.ПолучитьОбласть("СправочникВид");
		
		КолЗагруженных = 0;
		КолНеЗагруженных = 0;
		
		СтрокиОтбораЗагруженныхОбъектов = ТаблицаЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидСправочника));
		КолЗагруженных = СтрокиОтбораЗагруженныхОбъектов.Количество();
		
		СтрокиОтбораНеЗагруженныхОбъектов = ТаблицаНеЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидСправочника));
		КолНеЗагруженных = СтрокиОтбораНеЗагруженныхОбъектов.Количество();
		
		
		ОбластьСправочникВид.Параметры.Справочник = ВидСправочника;
		ОбластьСправочникВид.Параметры.КоличествоУспешно = КолЗагруженных;
		ОбластьСправочникВид.Параметры.КоличествоСОшибкой = КолНеЗагруженных;

		ТабДокумент.Вывести(ОбластьСправочникВид);
		
		Для Каждого СтрокаС_Ошибкой из СтрокиОтбораНеЗагруженныхОбъектов Цикл
			ОбластьСправочникОшибка = Макет.ПолучитьОбласть("СправочникОшибка");
			ОбластьСправочникОшибка.Параметры.Справочник = СтрокаС_Ошибкой.Представление;
			ТабДокумент.Вывести(ОбластьСправочникОшибка);
		КонецЦикла;
		
	КонецЦикла;
	
	
	ОбластьШапкаДокументы = Макет.ПолучитьОбласть("ШапкаДокументы");
	ТабДокумент.Вывести(ОбластьШапкаДокументы);

	Для Каждого ВидДокумента из МассивВидовДокументов Цикл
		
		ОбластьДокументВид = Макет.ПолучитьОбласть("ДокументВид");
		
		КолЗагруженных = 0;
		КолНеЗагруженных = 0;
				
		СтрокиОтбораЗагруженныхОбъектов = ТаблицаЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидДокумента));
		КолЗагруженных = СтрокиОтбораЗагруженныхОбъектов.Количество();
		
		СтрокиОтбораНеЗагруженныхОбъектов = ТаблицаНеЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидДокумента));
		КолНеЗагруженных = СтрокиОтбораНеЗагруженныхОбъектов.Количество();
		
		
		ОбластьДокументВид.Параметры.Документ = ВидДокумента;
		ОбластьДокументВид.Параметры.КоличествоУспешно = КолЗагруженных;
		ОбластьДокументВид.Параметры.КоличествоСОшибкой = КолНеЗагруженных;

		ТабДокумент.Вывести(ОбластьДокументВид);
		
		Для Каждого СтрокаЗагружено из СтрокиОтбораЗагруженныхОбъектов Цикл
			ОбластьДокументСтрока = Макет.ПолучитьОбласть("ДокументСтрока");
			ОбластьДокументСтрока.Параметры.Документ 	= СтрокаЗагружено.Представление;
			ОбластьДокументСтрока.Параметры.Статус 		= СтрокаЗагружено.Статус;
			ТабДокумент.Вывести(ОбластьДокументСтрока);
		КонецЦикла;

		Для Каждого СтрокаС_Ошибкой из СтрокиОтбораНеЗагруженныхОбъектов Цикл
			ОбластьДокументСтрока = Макет.ПолучитьОбласть("ДокументСтрока");
			ОбластьДокументСтрока.Параметры.Документ 	= СтрокаС_Ошибкой.Представление;
			ОбластьДокументСтрока.Параметры.Статус 	= СтрокаС_Ошибкой.Статус;
			ОбластьДокументСтрока.Параметры.ОписаниеОшибки = СтрокаС_Ошибкой.ОписаниеОшибки;
			ТабДокумент.Вывести(ОбластьДокументСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьШапкаБП = Макет.ПолучитьОбласть("ШапкаБизнесПроцессы");
	ТабДокумент.Вывести(ОбластьШапкаБП);
	
	Для Каждого ВидБизнесПроцесса из МассивВидовБП Цикл
		
		ОбластьБизнесПроцессВид = Макет.ПолучитьОбласть("БизнесПроцессВид");
		
		КолЗагруженных = 0;
		КолНеЗагруженных = 0;
				
		СтрокиОтбораЗагруженныхОбъектов = ТаблицаЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидБизнесПроцесса));
		КолЗагруженных = СтрокиОтбораЗагруженныхОбъектов.Количество();
		
		СтрокиОтбораНеЗагруженныхОбъектов = ТаблицаНеЗагруженныхОбъектов.НайтиСтроки(Новый Структура("Тип",ВидБизнесПроцесса));
		КолНеЗагруженных = СтрокиОтбораНеЗагруженныхОбъектов.Количество();
		
		
		ОбластьБизнесПроцессВид.Параметры.БизнесПроцесс = ВидБизнесПроцесса;
		ОбластьБизнесПроцессВид.Параметры.КоличествоУспешно = КолЗагруженных;
		ОбластьБизнесПроцессВид.Параметры.КоличествоСОшибкой = КолНеЗагруженных;

		ТабДокумент.Вывести(ОбластьБизнесПроцессВид);
		
		Для Каждого СтрокаЗагружено из СтрокиОтбораЗагруженныхОбъектов Цикл
			ОбластьБизнесПроцессСтрока = Макет.ПолучитьОбласть("БизнесПроцессСтрока");
			ОбластьБизнесПроцессСтрока.Параметры.БизнесПроцесс 	= СтрокаЗагружено.Представление;
			ОбластьБизнесПроцессСтрока.Параметры.Статус 		= СтрокаЗагружено.Статус;
			ОбластьОформления = ТабДокумент.Вывести(ОбластьБизнесПроцессСтрока);
            Если СтрокаЗагружено.Статус = "Изменен" Тогда
				ТабДокумент.Область(ОбластьОформления.Верх, ОбластьОформления.Лево, ОбластьОформления.Низ, ОбластьОформления.Лево).ЦветФона = WebЦвета.Красный;
			КонецЕсли; 
		КонецЦикла;

		Для Каждого СтрокаС_Ошибкой из СтрокиОтбораНеЗагруженныхОбъектов Цикл
			ОбластьБизнесПроцессСтрока = Макет.ПолучитьОбласть("БизнесПроцессСтрока");
			ОбластьБизнесПроцессСтрока.Параметры.БизнесПроцесс 	= СтрокаС_Ошибкой.Представление;
			ОбластьБизнесПроцессСтрока.Параметры.Статус 	= СтрокаС_Ошибкой.Статус;
			ОбластьБизнесПроцессСтрока.Параметры.ОписаниеОшибки = СтрокаС_Ошибкой.ОписаниеОшибки;
			ТабДокумент.Вывести(ОбластьБизнесПроцессСтрока);
		КонецЦикла;
		
	КонецЦикла;     
	
	СообщенияБазыПриемника = ПолучитьСообщенияПользователю(Истина);
	Для Каждого Сообщение ИЗ СообщенияБазыПриемника Цикл
		Область = Макет.ПолучитьОбласть("СтрокаСообщенияПользователю");
		Область.Параметры.СтрокаСообщенияПользователю = Сообщение.Текст;
		ТабДокумент.Вывести(Область);
	КонецЦикла;

	Возврат ТабДокумент;
	
КонецФункции  

Функция ПропискаРассылки(Знач НомерРассылки) 
	
	Перем ПараметрыПодключения, ИмяИБ;
	
	Попытка
		ПараметрыПодключения = ОбщегоНазначенияКлиентСервер.ПолучитьПараметрыПодключенияИзСтрокиСоединенияИнформационнойБазы(СтрокаСоединенияИнформационнойБазы());
		ИмяИБ = ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия;
	Исключение
	КонецПопытки;
	
	Прописка = " {" + НомерРассылки + ", ib: " + ?(ЗначениеЗаполнено(ИмяИБ), ИмяИБ, "< .. >") + "}";
	
	Возврат Прописка; 
	
КонецФункции 

Функция ТаблицаЗначенийИзXDTO(ТаблицаXDTO)
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	Для каждого Колонка из ТаблицаXDTO.Columns Цикл
		ТаблицаРезультат.Колонки.Добавить(Колонка.Имя); 
	КонецЦикла;
	
	Для каждого Строка из ТаблицаXDTO Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция УстановитьСостояниеПотокаОбмена(ИдентификаторОбмена, ИдентификаторПотока, СтатусЗагрузки, СостояниеОбмена, ВременныйИдентификаторПотока = Неопределено, ПараметрыОбработкиXML = Неопределено)   
	
		Если ЗначениеЗаполнено(ВременныйИдентификаторПотока) Тогда  
			ТекущийИдентификаторПотока = ВременныйИдентификаторПотока;  
		Иначе
			ТекущийИдентификаторПотока = ИдентификаторПотока;  
		КонецЕсли;   
	
		ПотокОбмена = РегистрыСведений.ExchDU_ПотокиОбмена.СоздатьМенеджерЗаписи();
		
		ПотокОбмена.ИдентификаторОбмена = ИдентификаторОбмена;
		ПотокОбмена.ИдентификаторПотока = ТекущийИдентификаторПотока;  
		ПотокОбмена.Прочитать(); 
		
		Если Не ПотокОбмена.Выбран() Тогда
			ПотокОбмена.ИдентификаторОбмена = ИдентификаторОбмена;
			ПотокОбмена.ИдентификаторПотока = ТекущийИдентификаторПотока;
			ПотокОбмена.ДатаОбмена = ТекущаяДата();   
		Иначе	
			ПотокОбмена.ИдентификаторПотока = ИдентификаторПотока;
		КонецЕсли;
		
		ПотокОбмена.СтатусЗагрузки = СтатусЗагрузки;  
		ПотокОбмена.СостояниеОбработки  = СостояниеОбмена; 
		Если ЗначениеЗаполнено(ПараметрыОбработкиXML) Тогда
			ПотокОбмена.ПараметрыОбработки = Новый ХранилищеЗначения(ПараметрыОбработкиXML);
		КонецЕсли;
		
		ПотокОбмена.Записать();
		
КонецФункции
